In [1]:
# Dependencies and Setup
import pandas as pd
import numpy as np

In [2]:
# csv path
purchase_data = "purchase_data.csv"

In [3]:
purchase_data_df = pd.read_csv(purchase_data)
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [4]:
purchase_data_df.columns

Index(['Purchase ID', 'SN', 'Age', 'Gender', 'Item ID', 'Item Name', 'Price'], dtype='object')

In [5]:
Purchase_ID = purchase_data_df["SN"].nunique()
Purchase_ID

576

In [6]:
Total_Players_df = pd.DataFrame({
    "Total Players": [576],
})
Total_Players_df

   Total Players
0            576

In [7]:
total_revenue = purchase_data_df["Price"].sum()
total_revenue

2379.77

In [8]:
Purchasing_Analysis_df = pd.DataFrame([
    {"Number of unique Items": 183, "Average Price": 3.05, "Number of Purchases": 780, "Total Revenue": 2379.77}  
])
Purchasing_Analysis_df

   Average Price  Number of Purchases  Number of unique Items  Total Revenue
0           3.05                  780                     183        2379.77

In [9]:
gender_count = purchase_data_df.groupby("Gender")["SN"].nunique()
gender_count

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Name: SN, dtype: int64

In [10]:
gender_percen = gender_count/576
gender_percen

Gender
Female                   0.140625
Male                     0.840278
Other / Non-Disclosed    0.019097
Name: SN, dtype: float64

In [11]:
# Gender Demographics
gender_demo = pd.DataFrame({"Total Count": gender_count, "Percentage of Players": gender_percen})
gender_demo

                       Total Count  Percentage of Players
Gender
Female                          81               0.140625
Male                           484               0.840278
Other / Non-Disclosed           11               0.019097

In [12]:
#Purchasing Analysis (Gender)
purchase_by_gender = purchase_data_df.groupby("Gender")["Item ID"]
purchase_by_gender.count()
purchase_by_gender_df = purchase_by_gender.count()

In [13]:
# Average price by gender.
gender_mean_purchase = purchase_data_df.groupby("Gender")["Price"].mean()
gender_mean_purchase

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [14]:
gender_purchase_value = purchase_data_df.groupby("Gender")["Price"].sum()
gender_purchase_value

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [15]:
Total_per_person = gender_purchase_value/gender_count
Total_per_person

Gender
Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [16]:
# Data frame to hold the results
purchase_analysis = pd.DataFrame({"Purchase Count": purchase_by_gender_df, "Average Purchase Price": gender_mean_purchase, "Total Purchase Value": gender_purchase_value, 
                                 "Avg Total Purchase per Person": Total_per_person})
purchase_analysis

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

In [17]:
bins = [0,10,15,20,25,30,35,40,45]
group_lables = ["<10", "10 to 14", "15 to 19", "20 to 24", 
                "25 to 29", "30 to 34", "35 to 39", "40 to 45"]

In [18]:
pd.cut(purchase_data_df["Age"], bins, labels=group_lables)

0      15 to 19
1      35 to 39
2      20 to 24
3      20 to 24
4      20 to 24
5      20 to 24
6      35 to 39
7      15 to 19
8      20 to 24
9      30 to 34
10     20 to 24
11     20 to 24
12     20 to 24
13     20 to 24
14     30 to 34
15     20 to 24
16     15 to 19
17     20 to 24
18     20 to 24
19     25 to 29
20     15 to 19
21     15 to 19
22     35 to 39
23     35 to 39
24     25 to 29
25     25 to 29
26     10 to 14
27          <10
28     20 to 24
29     20 to 24
         ...
750    20 to 24
751    10 to 14
752    15 to 19
753    35 to 39
754    20 to 24
755    10 to 14
756    15 to 19
757    15 to 19
758    20 to 24
759    20 to 24
760    20 to 24
761    40 to 45
762    25 to 29
763    20 to 24
764    15 to 19
765    15 to 19
766    20 to 24
767         <10
768    35 to 39
769    10 to 14
770    30 to 34
771    15 to 19
772    25 to 29
773    20 to 24
774    10 to 14
775    20 to 24
776    20 to 24
777    15 to 19
778         <10
779    20 to 24
Name: Age, Length: 780, dtype: category
Categories (8, object): [<10 < 10 to 14 < 15 to 19 < 20 to 24 < 25 to 29 < 30 to 34 < 35 to 39 < 40 to 45]

In [19]:
purchase_data_df["Age Range"] = pd.cut(purchase_data_df["Age"], bins, labels=group_lables)
purchase_data_df.head(2)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Range
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,15 to 19
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,35 to 39

In [20]:
age_percen = round(purchase_data_df["Age Range"].value_counts()/576,2)
age_percen.head()

20 to 24    0.56
15 to 19    0.35
25 to 29    0.13
10 to 14    0.09
30 to 34    0.09
Name: Age Range, dtype: float64

In [21]:
purchase_count_per_age_df = purchase_data_df.groupby("Age Range")["Item ID"]
purchase_count_per_age_df.count()
count_agedpurchase_df = purchase_count_per_age_df.count()

In [22]:
agebased_ave_purchase = purchase_data_df.groupby("Age Range")["Price"].mean()
agebased_ave_purchase.round(2)

Age Range
<10         3.40
10 to 14    2.90
15 to 19    3.11
20 to 24    3.02
25 to 29    2.88
30 to 34    2.99
35 to 39    3.40
40 to 45    3.08
Name: Price, dtype: float64

In [23]:
age_group_total_df = purchase_data_df.groupby("Age Range")["Price"].sum()
age_group_total_df

Age Range
<10         108.96
10 to 14    156.60
15 to 19    621.56
20 to 24    981.64
25 to 29    221.42
30 to 34    155.71
35 to 39    112.35
40 to 45     21.53
Name: Price, dtype: float64

In [24]:
ave_age_total_df = age_group_total_df/576
ave_age_total_df.head()

Age Range
<10         0.189167
10 to 14    0.271875
15 to 19    1.079097
20 to 24    1.704236
25 to 29    0.384410
Name: Price, dtype: float64

In [25]:
Agebase_Purchase_Analysis = pd.DataFrame({"Purchase Count": count_agedpurchase_df,
                                          "Average Purchase Price": agebased_ave_purchase,
                                          "Total Purchase Value": age_group_total_df,
                                          "Avg Total Purchase per Person": ave_age_total_df
})
Agebase_Purchase_Analysis

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Range,,,,
<10,32,3.405000,108.96,0.189167
10 to 14,54,2.900000,156.60,0.271875
15 to 19,200,3.107800,621.56,1.079097
20 to 24,325,3.020431,981.64,1.704236
25 to 29,77,2.875584,221.42,0.384410
30 to 34,52,2.994423,155.71,0.270330
35 to 39,33,3.404545,112.35,0.195052
40 to 45,7,3.075714,21.53,0.037378

In [61]:
purchase_count_df = purchase_data_df.groupby("SN")["Price"].count()
purchase_count_df.head()
purchase_numbers_df = purchase_count_df

In [62]:
ave_person_purchase_df = purchase_data_df.groupby("SN")["Price"].mean()
ave_person_purchase_df.head()

SN
Adairialis76    2.28
Adastirin33     4.48
Aeda94          4.91
Aela59          4.32
Aelaria33       1.79
Name: Price, dtype: float64

In [63]:
total_person_purchase_df = purchase_data_df.groupby("SN")["Price"].sum()
total_person_purchase_df.head()

SN
Adairialis76    2.28
Adastirin33     4.48
Aeda94          4.91
Aela59          4.32
Aelaria33       1.79
Name: Price, dtype: float64

In [64]:
top_spenders_df = pd.DataFrame({"Purchase Count": purchase_count_df,
                 "Average Purchase Price": ave_person_purchase_df,
                 "Total Purchase Value": total_person_purchase_df
})
top_spenders_df.head()

              Purchase Count  Average Purchase Price  Total Purchase Value
SN
Adairialis76               1                    2.28                  2.28
Adastirin33                1                    4.48                  4.48
Aeda94                     1                    4.91                  4.91
Aela59                     1                    4.32                  4.32
Aelaria33                  1                    1.79                  1.79

In [68]:
# Sort the total purchase value column in descending order
spender_the_most_df = top_spenders_df.sort_values("Total Purchase Value", ascending=False)
spender_the_most_df.head()

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iral74                    4                3.405000                 13.62
Iskadarya95               3                4.366667                 13.10

In [73]:
Item_count_df = purchase_data_df.groupby(["Item ID", "Item Name"])["Price"].count()
Item_number_df = Item_count_df.head()

In [76]:
Item_total_df = purchase_data_df.groupby(["Item ID", "Item Name"])["Price"].sum()
Item_total_df.head()

Item ID  Item Name
0        Splinter               5.12
1        Crucifer               9.78
2        Verdict               14.88
3        Phantomlight          14.94
4        Bloodlord's Fetish     8.50
Name: Price, dtype: float64

In [77]:
Item_average_df = purchase_data_df.groupby(["Item ID", "Item Name"])["Price"].mean()
Item_average_df.head()

Item ID  Item Name
0        Splinter              1.28
1        Crucifer              3.26
2        Verdict               2.48
3        Phantomlight          2.49
4        Bloodlord's Fetish    1.70
Name: Price, dtype: float64

In [79]:
populare_items_df = pd.DataFrame({"Purchase Count": Item_count_df,
                                  "Item Price": Item_average_df,
                                  "Total Purchase Value": Item_total_df
})
populare_items_df.head()

                            Purchase Count  Item Price  Total Purchase Value
Item ID Item Name
0       Splinter                         4        1.28                  5.12
1       Crucifer                         3        3.26                  9.78
2       Verdict                          6        2.48                 14.88
3       Phantomlight                     6        2.49                 14.94
4       Bloodlord's Fetish               5        1.70                  8.50

In [80]:
most_popular_df = populare_items_df.sort_values("Purchase Count", ascending=False)
most_popular_df.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
145,Fiery Glass Crusader,9,4.58,41.22
108,"Extraction, Quickblade Of Trembling Hands",9,3.53,31.77
82,Nirvana,9,4.90,44.10
19,"Pursuit, Cudgel of Necromancy",8,1.02,8.16

In [81]:
# Most Profitable 
most_profitable_df = populare_items_df.sort_values("Total Purchase Value", ascending=False)
most_profitable_df.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
82,Nirvana,9,4.90,44.10
145,Fiery Glass Crusader,9,4.58,41.22
92,Final Critic,8,4.88,39.04
103,Singed Scalpel,8,4.35,34.80